tap "azure/kubelogin"

brew "ansible"
brew "argocd"
brew "asdf"
brew "azure-cli"
brew "base64"
brew "bash"
brew "direnv"
brew "fzf"
brew "git"
brew "gh"
brew "gnupg"
brew "graphviz"
brew "jq"
brew "Azure/kubelogin/kubelogin"
brew "neovim"
brew "moreutils"
brew "packer"
brew "pipenv"
brew "pipx"
brew "podman"
brew "pre-commit"
brew "terraform-docs"
brew "tflint"
brew "tmux"
brew "thefuck"
brew "tree"
brew "watch"
brew "vault"
brew "yq"

cask "alacritty"
cask "appcleaner"
cask "brave-browser"
cask "cold-turkey-blocker"
cask "flux"
cask "figma"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "keyboardcleantool"
cask "microsoft-teams"
cask "onedrive"
cask "pgadmin4"
cask "slack"
cask "tunnelblick"
cask "visual-studio-code"
cask "vivaldi"
cask "wezterm"
cask "zoom"

vscode "ms-vscode-remote.remote-containers"
vscode "eamodio.gitlens"
vscode "hashicorp.terraform"
vscode "foxundermoon.shell-format"
vscode "jebbs.plantuml"
vscode "yzhang.markdown-all-in-one"
vscode "piotrpalarz.vscode-gitignore-generator"
vscode "zhuangtongfa.material-theme"
